Repository: noah-nuebling/mac-mouse-fix
Catalog: Markdown/Strings/Support/Guides/CapturedButtonsMMF3.xcstrings
Source language: en
Languages: cs, de, ru

# 01: intro
source: # {docname_captured_buttons_mmf3} While using Mac Mouse Fix, you may have encountered a message saying that a button on your mouse is now being 'captured' by Mac Mouse Fix. {screenshot_0} In this article, you'll learn what this means, what problems it can cause, and how to work around them.
cs: # {docname_captured_buttons_mmf3} Při používání nástroje Mac Mouse Fix jste se mohli setkat se zprávou, že tlačítko na vaší myši je nyní 'zachycováno' nástrojem Mac Mouse Fix. {screenshot_0} V tomto článku se dozvíte, co to znamená, jaké problémy to může způsobit a jak je obejít.
de: # {docname_captured_buttons_mmf3} Beim Verwenden von Mac Mouse Fix, bist du vielleicht schonmal auf eine Nachricht gestoßen, die besagt, dass eine Taste deiner Maus jetzt von Mac Mouse Fix 'abgefangen' wird. {screenshot_0} In diesem Artikel erfährst du, was das bedeutet, welche Probleme es auslösen kann, und wie du mit ihnen umgehen kannst.
ru: # {docname_captured_buttons_mmf3} При использовании Mac Mouse Fix вы могли столкнуться с сообщением о том, что кнопка на вашей мыши в данный момент 'захвачена' Mac Mouse Fix. {screenshot_0} В этой статье вы узнаете, что это означает, какие проблемы это может вызвать и как их решить.

# 02: terminology
source: ## What does 'capturing' a mouse button mean? A mouse button that is captured by Mac Mouse Fix can't be seen by other apps or by macOS anymore. The functions which this button would normally perform won't work while it's being captured. **Example**: Normally you can go backward and forward in Chrome by clicking the side buttons (buttons 4 and 5) of the mouse. But when the side buttons are captured by Mac Mouse Fix, this no longer works. Instead, the side buttons will only trigger the actions that you've assigned to them in Mac Mouse Fix. **Why does Mac Mouse Fix do this?** Mac Mouse Fix hides buttons from other apps to prevent you from accidentally triggering other functions while using Mac Mouse Fix gestures. For example, if you click and drag button 4 to switch between desktops, you would always **simultaneously** go back a page in Chrome.
cs: ## Co znamená 'zachycení' tlačítka myši? Tlačítko myši, které je zachyceno aplikací Mac Mouse Fix, již nevidí ostatní aplikace ani systém macOS. Funkce, které by toto tlačítko normálně plnilo, nebudou během jeho zachycování fungovat. **Příklad**: V Chromu se obvykle můžete pohybovat vpřed a vzad kliknutím na boční tlačítka (tlačítka 4 a 5) myši. Když ale Mac Mouse Fix boční tlačítka zachytí, tato funkce již nefunguje. Místo toho budou boční tlačítka spouštět pouze akce, které jste jim v Mac Mouse Fix přiřadili. **Proč to Mac Mouse Fix dělá?** Mac Mouse Fix skrývá tlačítka před ostatními aplikacemi, aby se zabránilo náhodnému spuštění jiných funkcí při používání gest Mac Mouse Fix. Pokud například kliknete a přetáhnete tlačítko 4 pro přepínání mezi plochami, vždy se **současně** vrátíte o stránku zpět v Chromu.
de: ## Was bedeutet 'abfangen' einer Maustaste? Eine Maustaste, die von Mac Mouse Fix abgefangen wird, kann von anderen Apps und von macOS nicht mehr gesehen werden. Die Funktionen, die diese Taste normalerweise ausführen würde, funktionieren nicht, solange sie abgefangen wird. **Beispiel**: Normalerweise kann man in Chrome Vor und Zurück gehen, indem man die Seitentasten (Taste 4 und 5) der Maus klickt. Doch wenn die Seitentasten von Mac Mouse Fix abgefangen werden, dann funktioniert das nicht mehr. Stattdessen lösen die Seitentasten dann nur noch die Aktionen aus, die du ihnen in Mac Mouse Fix zugewiesen hast. **Warum macht Mac Mouse Fix das?** Mac Mouse Fix versteckt Tasten vor anderen Apps, damit du beim Verwenden von Mac Mouse Fix Gesten nicht aus Versehen auch gleichzeitig andere Funktionen auslöst. Wenn du z.B. Taste 4 klickst und ziehst um zwischen Schreibtischen zu wechseln, dann würdest du auch immer **gleichzeitig** eine Seite in Chrome zurückgehen.
ru: ## Что означает 'захват' кнопки мыши? Кнопка мыши, захваченная Mac Mouse Fix, больше не видна другим приложениям или macOS. Функции, которые обычно выполняет эта кнопка, не будут работать, пока она захвачена. **Пример**: Обычно в Chrome можно переходить назад и вперед, нажимая боковые кнопки (кнопки 4 и 5) мыши. Но когда боковые кнопки захвачены Mac Mouse Fix, это больше не работает. Вместо этого боковые кнопки будут запускать только те действия, которые вы им назначили в Mac Mouse Fix. **Почему Mac Mouse Fix так поступает?** Mac Mouse Fix скрывает кнопки от других приложений, чтобы вы не могли случайно запустить другие функции при использовании жестов Mac Mouse Fix. Например, если вы нажмете и перетащите кнопку 4 для переключения между рабочими столами, вы всегда будете **одновременно** возвращаться на предыдущую страницу в Chrome.

# 03: which-buttons
source: ## How do I know which buttons are being captured by Mac Mouse Fix? Any button that shows up on the left side of the 'Buttons' tab is being captured by Mac Mouse Fix. In the following image **'Middle Button'**, **'Button 5'**, and **'Button 4'** are being captured: <br> {screenshot_1}
cs: ## Jak zjistím, která tlačítka jsou zachycena programem Mac Mouse Fix? Mac Mouse Fix zachycuje všechna tlačítka, která se zobrazují na levé straně záložky 'Tlačítka'. Na následujícím obrázku jsou zachycena **'Prostřední tlačítko'**, **'Tlačítko 5'** a **'Tlačítko 4'**: <br> {screenshot_1}
de: ## Woher weiß ich, welche Tasten von Mac Mouse Fix abgefangen werden? Jede Taste, die links im 'Tasten'-Tab angezeigt wird, wird von Mac Mouse Fix abgefangen. Im folgenden Bild werden die **'Mittlere Taste'**, **'Taste 5'** und **'Taste 4'** abgefangen: <br> {screenshot_1}
ru: ## Как узнать, какие кнопки захватываются Mac Mouse Fix? Любая кнопка, отображаемая в левой части вкладки 'Кнопки', захватывается Mac Mouse Fix. На следующем изображении захватываются **'Средняя кнопка'**, **'Кнопка 5'** и **'Кнопка 4'**: <br> {screenshot_1}

# 04: uncapturing
source: ## How do I prevent Mac Mouse Fix from capturing a mouse button? To prevent Mac Mouse Fix from capturing a mouse button, delete all entries for that mouse button from the 'Buttons' tab. You can delete an entry in the 'Buttons' tab by clicking the '-' button on the left. For example, in the following image, you could prevent **'Button 4'** from being captured by clicking the two highlighted **'-'** buttons: {screenshot_2}
cs: ## Jak zabráním nástroji Mac Mouse Fix v zachycení tlačítka myši? Chcete-li zabránit nástroji Mac Mouse Fix v zachycení tlačítka myši, smažte všechny položky pro dané tlačítko myši na kartě 'Tlačítka'. Položku na kartě 'Tlačítka' můžete smazat kliknutím na tlačítko '-' vlevo. Například na následujícím obrázku můžete zabránit zachycení tlačítka **'Tlačítko 4'** kliknutím na dvě zvýrazněná tlačítka **'-'**: {screenshot_2}
de: ## Wie verhindere ich, dass Mac Mouse Fix eine Maustaste abfängt? Um zu verhindern, dass Mac Mouse Fix eine Maustaste abfängt, lösche alle Einträge für diese Maustaste aus dem 'Tasten'-Tab. Du kannst einen Eintrag im 'Tasten'-Tab löschen, indem du die '-' Taste links anklickst. z.B. könnte man im folgenden Bild das Abfangen von **'Taste 4'** verhindern, indem man die beiden hervorgehobenen **'-'** Tasten anklickt: {screenshot_2}
ru: ## Как запретить Mac Mouse Fix захватывать кнопку мыши? Чтобы запретить Mac Mouse Fix захватывать кнопку мыши, удалите все записи для этой кнопки мыши на вкладке 'Кнопки'. Вы можете удалить запись на вкладке 'Кнопки', нажав кнопку '-' слева. Например, на следующем изображении вы можете запретить захват **'Кнопки 4'**, нажав две выделенные кнопки **'-'**: {screenshot_2}

# 05: restoring
source: ## How can I restore the original functionality of a button? To make a button behave like it did before you installed Mac Mouse Fix, you can do the following: 1. You can **prevent the button from being captured** – as described above. 2. You can simply **turn off Mac Mouse Fix** – then no buttons will be captured. 3. You can **assign specific actions to the button in Mac Mouse Fix** – this way you can restore certain functions, *even while the button is being captured*:
cs: ## Jak mohu obnovit původní funkčnost tlačítka? Chcete-li, aby se tlačítko chovalo stejně jako před instalací Mac Mouse Fix, můžete provést následující: 1. Můžete **zabránit zachycení tlačítka** – jak je popsáno výše. 2. Můžete jednoduše **vypnout Mac Mouse Fix** – pak se žádná tlačítka nebudou zachycovat. 3. Můžete **tlačítku v Mac Mouse Fix** přiřadit konkrétní akce – tímto způsobem můžete obnovit určité funkce, *i během zachycování tlačítka*:
de: ## Wie kann ich die ursprüngliche Funktion einer Taste wiederherstellen? Damit sich eine Taste wieder so verhält, wie bevor du Mac Mouse Fix installiert hast, kannst du: 1. Du kannst **verhindern, dass die Taste abgefangen wird** – so wie oben beschrieben. 2. Du kannst **Mac Mouse Fix** auch einfach **ausschalten** – dann werden keinerlei Tasten mehr abgefangen. 3. Du kannst **der Taste bestimmte Aktionen in Mac Mouse Fix zuweisen** – so kannst du bestimmte Funktionen wiederherstellen, *auch während die Taste abgefangen wird*:
ru: ## Как восстановить исходную функциональность кнопки? Чтобы кнопка работала так же, как до установки Mac Mouse Fix, можно выполнить следующие действия: 1. Можно **запретить захват кнопки**, как описано выше. 2. Вы можете просто **отключить Mac Mouse Fix** – тогда никакие кнопки не будут захватываться. 3. Вы можете **назначить кнопке определенные действия в Mac Mouse Fix** – таким образом вы сможете восстановить определенные функции, *даже когда кнопка захвачена*:

# 06: restoring.header.default
source: Button
cs: Tlačítko
de: Taste
ru: Кнопка

# 07: restoring.header.function
source: Original Function
cs: Původní funkce
de: Ursprüngliche Funktion
ru: Исходная функция

# 08: restoring.header.action
source: Action in Mac Mouse Fix
cs: Akce v Mac Mouse Fix
de: Aktion in Mac Mouse Fix
ru: Действие в Mac Mouse Fix

# 09: restoring.row1.default
source: Middle Mouse Button
cs: Prostřední tlačítko myši
de: Mittlere Maustaste
ru: Средняя кнопка мыши

# 10: restoring.row1.function
source: Open links in the browser in a new tab
cs: Otevírat odkazy v prohlížeči na nové kartě
de: Links im Browser in einem neuen Tab öffnen
ru: Открыть ссылки в браузере в новой вкладке

# 11: restoring.row1.action
source: 'Middle Click'<br>(Can be assigned to **clicking** a button)
cs: 'Kliknutí prostředním tlačítkem'<br>(Lze přiřadit **kliknutí** na tlačítko)
de: 'Mittelklick'<br>(Kann dem *klicken* einer Taste zugewiesen werden)
ru: 'Средний щелчок'<br>(Может быть назначен для **щелчка** кнопкой)

# 12: restoring.row2.default
source: Middle Mouse Button
cs: Prostřední tlačítko myši
de: Mittlere Maustaste
ru: Средняя кнопка мыши

# 13: restoring.row2.function
source: Paste text in the terminal
cs: Vložení textu do terminálu
de: Text im Terminal einfügen
ru: Вставить текст в терминал

# 14: restoring.row2.action
source: 'Middle Click'<br>(Can be assigned to **clicking** a button)
cs: 'Kliknutí prostředním tlačítkem'<br>(Lze přiřadit **kliknutí** na tlačítko)
de: 'Mittelklick'<br>(Kann dem *klicken* einer Taste zugewiesen werden)
ru: 'Средний щелчок'<br>(Может быть назначен для **щелчка** кнопкой)

# 15: restoring.row3.default
source: Mouse Button 4 / Mouse Button 5
cs: Tlačítko myši 4 / Tlačítko myši 5
de: Maustaste 4 / Maustaste 5
ru: Кнопка мыши 4 / Кнопка мыши 5

# 16: restoring.row3.function
source: Go back / forward in Chrome and other apps
cs: Přechod zpět / vpřed v Chromu a dalších aplikacích
de: Zurück / Vorwärts gehen in Chrome und anderen Apps
ru: Вернуться назад / перейти вперед в Chrome и других приложениях

# 17: restoring.row3.action
source: 'Back' / 'Forward'<br>(Can be assigned to **clicking** a button)
cs: 'Zpět'/ 'Vpřed'<br>(Lze přiřadit **kliknutí** tlačítka)
de: 'Zurück' / 'Vorwärts'<br>(Kann dem *klicken* einer Taste zugewiesen werden)
ru: 'Назад' / 'Вперед'<br>(Может быть назначен для **щелчка** кнопкой)

# 18: restoring.row4.default
source: Middle Mouse Button
cs: Prostřední tlačítko myši
de: Mittlere Maustaste
ru: Средняя кнопка мыши

# 19: restoring.row4.function
source: Orbit around objects in Blender (and other 3D apps)
cs: Obíhání objektů v Blenderu (a dalších 3D aplikacích)
de: Um Objekte in Blender (und anderen 3D-Apps) kreisen
ru: Орбита вокруг объектов в Blender (и других 3D-приложениях)

# 20: restoring.row4.action
source: 'Scroll & Navigate'<br>(Can be assigned to **clicking and dragging** a button)
cs: 'Scrolování a navigace'<br>(Lze přiřadit **kliknutí a přetažení** tlačítka)
de: 'Scrollen & Navigieren'<br>(Kann dem *klicken und ziehen* einer Taste zugewiesen werden)
ru: 'Прокрутка и навигация'<br>(Может быть назначено **щелчку и перетаскиванию** кнопки)

# 21: restoring.footer
source: This way you can keep using the button's usual functionality, while also assigning *additional* functions to it in Mac Mouse Fix.
cs: Tímto způsobem můžete i nadále používat obvyklé funkce tlačítka a zároveň mu v nástroji Mac Mouse Fix přiřadit *další* funkce.
de: So kannst du weiter wie gewohnt die Taste verwenden, aber ihr gleichzeitig *zusätzliche* Funktionen in Mac Mouse Fix zuweisen!
ru: Таким образом, вы можете продолжать использовать обычную функциональность кнопки, а также назначать ей *дополнительные* функции в Mac Mouse Fix.

# 22: also-see
source: ## Also see - [{docname_captured_scroll_wheels}](<{url}>)
cs: ## Viz také - [{docname_captured_scroll_wheels}](<{url}>)
de: ## Siehe auch - [{docname_captured_scroll_wheels}](<{url}>)
ru: ## См. также - [{docname_captured_scroll_wheels}](<{url}>)
